Tekla Open API Reference for Tekla Structures 2025
CustomLineType.Description Property
 The Description of the custom line type (ASCII representation of the line).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
CustomLineType Class
Tekla.Structures.Drawing Namespace